#![allow(dead_code)]
#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
/* automatically generated by rust-bindgen 0.72.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: i32 = 1;
pub const _SAL_VERSION: i32 = 20;
pub const __SAL_H_VERSION: i32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: i32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: i32 = 0;
pub const _CRT_PACKING: i32 = 8;
pub const _HAS_EXCEPTIONS: i32 = 1;
pub const _STL_LANG: i32 = 0;
pub const _HAS_CXX17: i32 = 0;
pub const _HAS_CXX20: i32 = 0;
pub const _HAS_CXX23: i32 = 0;
pub const _HAS_CXX26: i32 = 0;
pub const _HAS_NODISCARD: i32 = 0;
pub const WCHAR_MIN: i32 = 0;
pub const WCHAR_MAX: i32 = 65535;
pub const WINT_MIN: i32 = 0;
pub const WINT_MAX: i32 = 65535;
pub const WIN64: i32 = 1;
pub const WIN32: i32 = 1;
pub const _NI_mswin64_: i32 = 1;
pub const _NI_i386_: i32 = 1;
pub const _NI_mswin_: i32 = 1;
pub const _CVI_USE_FUNCS_FOR_VARS_: i32 = 1;
pub const DLL_PROCESS_ATTACH: i32 = 1;
pub const DLL_THREAD_ATTACH: i32 = 2;
pub const DLL_THREAD_DETACH: i32 = 3;
pub const DLL_PROCESS_DETACH: i32 = 0;
pub const THREAD_BASE_PRIORITY_LOWRT: i32 = 15;
pub const THREAD_BASE_PRIORITY_MAX: i32 = 2;
pub const THREAD_BASE_PRIORITY_MIN: i32 = -2;
pub const THREAD_BASE_PRIORITY_IDLE: i32 = -15;
pub const THREAD_PRIORITY_TIME_CRITICAL: i32 = 15;
pub const THREAD_PRIORITY_HIGHEST: i32 = 2;
pub const THREAD_PRIORITY_ABOVE_NORMAL: i32 = 1;
pub const THREAD_PRIORITY_NORMAL: i32 = 0;

pub const ATTR_ANTI_ALIASED_PLOTS: i32 = 1156;
pub const ATTR_PAPER_HEIGHT: i32 = 1301;
pub const ATTR_PAPER_WIDTH: i32 = 1302;
pub const ATTR_INNER_LOG_MARKERS_VISIBLE: i32 = 1120;
pub const VAL_USE_PRINTER_DEFAULT: i32 = -1;
pub const VAL_XAXIS: i32 = 0;
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
	pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
	pub fn __security_init_cookie();
}
unsafe extern "C" {
	pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
	pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
	pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
	_unused: [u8; 0],
}
pub type HINSTANCE = *mut HINSTANCE__;
pub type BOOL = ::std::os::raw::c_int;
pub type DWORD = ::std::os::raw::c_ulong;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPSTR = *mut ::std::os::raw::c_char;
pub type HANDLE = *mut ::std::os::raw::c_void;
unsafe extern "C" {
	pub fn InitCVIRTEEx(
		hInstance: *mut ::std::os::raw::c_void,
		argv: *mut *mut ::std::os::raw::c_char,
		reserved: *mut ::std::os::raw::c_void,
	) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
	pub fn CVIRTEHasBeenDetached() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
	pub fn CloseCVIRTE();
}
pub type KeyCodeUnicode = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ColorMapEntry {
	pub dataValue: ColorMapEntry__bindgen_ty_1,
	pub color: ::std::os::raw::c_int,
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub union ColorMapEntry__bindgen_ty_1 {
	pub valChar: ::std::os::raw::c_char,
	pub valInt: ::std::os::raw::c_int,
	pub valInt64: ::std::os::raw::c_longlong,
	pub valShort: ::std::os::raw::c_short,
	pub valFloat: f32,
	pub valDouble: f64,
	pub valUChar: ::std::os::raw::c_uchar,
	pub valULong: ::std::os::raw::c_ulong,
	pub valUInt64: ::std::os::raw::c_ulonglong,
	pub valUShort: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ColorMapEntry__bindgen_ty_1"]
		[::std::mem::size_of::<ColorMapEntry__bindgen_ty_1>() - 8usize];
	["Alignment of ColorMapEntry__bindgen_ty_1"]
		[::std::mem::align_of::<ColorMapEntry__bindgen_ty_1>() - 4usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valChar"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valChar) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valInt"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valInt) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valInt64"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valInt64) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valShort"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valShort) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valFloat"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valFloat) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valDouble"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valDouble) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valUChar"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valUChar) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valULong"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valULong) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valUInt64"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valUInt64) - 0usize];
	["Offset of field: ColorMapEntry__bindgen_ty_1::valUShort"]
		[::std::mem::offset_of!(ColorMapEntry__bindgen_ty_1, valUShort) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of ColorMapEntry"][::std::mem::size_of::<ColorMapEntry>() - 12usize];
	["Alignment of ColorMapEntry"][::std::mem::align_of::<ColorMapEntry>() - 4usize];
	["Offset of field: ColorMapEntry::dataValue"]
		[::std::mem::offset_of!(ColorMapEntry, dataValue) - 0usize];
	["Offset of field: ColorMapEntry::color"]
		[::std::mem::offset_of!(ColorMapEntry, color) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Rect {
	pub top: ::std::os::raw::c_int,
	pub left: ::std::os::raw::c_int,
	pub height: ::std::os::raw::c_int,
	pub width: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of Rect"][::std::mem::size_of::<Rect>() - 16usize];
	["Alignment of Rect"][::std::mem::align_of::<Rect>() - 4usize];
	["Offset of field: Rect::top"][::std::mem::offset_of!(Rect, top) - 0usize];
	["Offset of field: Rect::left"][::std::mem::offset_of!(Rect, left) - 4usize];
	["Offset of field: Rect::height"][::std::mem::offset_of!(Rect, height) - 8usize];
	["Offset of field: Rect::width"][::std::mem::offset_of!(Rect, width) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Point {
	pub x: ::std::os::raw::c_int,
	pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of Point"][::std::mem::size_of::<Point>() - 8usize];
	["Alignment of Point"][::std::mem::align_of::<Point>() - 4usize];
	["Offset of field: Point::x"][::std::mem::offset_of!(Point, x) - 0usize];
	["Offset of field: Point::y"][::std::mem::offset_of!(Point, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
	pub Data1: ::std::os::raw::c_ulong,
	pub Data2: ::std::os::raw::c_ushort,
	pub Data3: ::std::os::raw::c_ushort,
	pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
	["Size of _GUID"][::std::mem::size_of::<_GUID>() - 16usize];
	["Alignment of _GUID"][::std::mem::align_of::<_GUID>() - 4usize];
	["Offset of field: _GUID::Data1"][::std::mem::offset_of!(_GUID, Data1) - 0usize];
	["Offset of field: _GUID::Data2"][::std::mem::offset_of!(_GUID, Data2) - 4usize];
	["Offset of field: _GUID::Data3"][::std::mem::offset_of!(_GUID, Data3) - 6usize];
	["Offset of field: _GUID::Data4"][::std::mem::offset_of!(_GUID, Data4) - 8usize];
};
pub type GUID = _GUID;
pub type IID = GUID;
pub type LPIID = *mut IID;
pub type CLSID = GUID;
pub type LPCLSID = *mut CLSID;
pub type FMTID = GUID;
pub type LPFMTID = *mut FMTID;
pub type CAObjHandle = isize;
pub type HRESULT = ::std::os::raw::c_long;
pub const UIError_UIENoError: UIError = 0;
pub const UIError_UIEManagerCouldNotOpen: UIError = -1;
pub const UIError_UIESystemFontCouldNotBeLoaded: UIError = -2;
pub const UIError_UIEOperationInvalidDuringPopUp: UIError = -3;
pub const UIError_UIEHandleInvalid: UIError = -4;
pub const UIError_UIEAttemptToMovePanelToInvalidLocation: UIError = -5;
pub const UIError_UIEAttemptedToMakeInoperableCtrlActive: UIError = -6;
pub const UIError_UIEOperationRequirePanelBeLoaded: UIError = -7;
pub const UIError_UIEOperationRequiresPopUpBeActive: UIError = -8;
pub const UIError_UIEOperationRequiresMenuBeLoaded: UIError = -9;
